{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "conv2d_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "conv2d_input"}, "inbound_nodes": []}, {"name": "lambda", "class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAACgAAAAUAAABTAAAAc4YAAAB0AKABfAChAX0DfANkAWQChQIZAH0EfANkAmQBhQIZ\nAH0FfAR8AhoAfQZ8AXwCZAIYAGsCckR8BHwGfAEUABgAfQduBHwGfQd0AGoCfAd8BWcCZANkBI0C\nfQd0AGoCfAZ8BWQDFABnAmQDZASNAn0IfAh8ARQAfQl0AKADfAB8CXwHoQNTACkF+txTbGljZSBh\nbiBhcnJheSBpbnRvIGBwYXJ0c2Agc2xpY2VzIGFuZCByZXR1cm4gc2xpY2UgYGlgLgoKICAgIEFy\nZ3VtZW50czoKICAgICAgZGF0YTogYXJyYXkgdG8gc2xpY2UuCiAgICAgIGk6IGluZGV4IG9mIHNs\naWNlIHRvIHJldHVybi4KICAgICAgcGFydHM6IG51bWJlciBvZiBzbGljZXMgdG8gbWFrZS4KCiAg\nICBSZXR1cm5zOgogICAgICBTbGljZSBgaWAgb2YgYGRhdGFgLgogICAgTukBAAAA6QAAAAApAdoE\nYXhpcykE2glhcnJheV9vcHPaBXNoYXBl2gZjb25jYXTaBXNsaWNlKQraBGRhdGHaAWnaBXBhcnRz\ncgYAAADaCmJhdGNoX3NpemXaC2lucHV0X3NoYXBl2gRzdGVw2gRzaXpl2gZzdHJpZGXaBXN0YXJ0\nqQByEgAAAPp4L2dsb2JhbC9ob21lL3VzZXJzL21qd2lsc29uLy5jb25kYS9lbnZzL250Zi9saWIv\ncHl0aG9uMy43L3NpdGUtcGFja2FnZXMvdGVuc29yZmxvdy9weXRob24va2VyYXMvdXRpbHMvbXVs\ndGlfZ3B1X3V0aWxzLnB52glnZXRfc2xpY2W4AAAAcxYAAAAACwoBDAEMAQgBDAEOAgQBEgEWAQgB\n", null, null], "module": "tensorflow.python.keras.utils.multi_gpu_utils", "function_type": "lambda", "output_shape": [28, 28, 1], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"i": 0, "parts": 2}}, "inbound_nodes": [[["conv2d_input", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAACgAAAAUAAABTAAAAc4YAAAB0AKABfAChAX0DfANkAWQChQIZAH0EfANkAmQBhQIZ\nAH0FfAR8AhoAfQZ8AXwCZAIYAGsCckR8BHwGfAEUABgAfQduBHwGfQd0AGoCfAd8BWcCZANkBI0C\nfQd0AGoCfAZ8BWQDFABnAmQDZASNAn0IfAh8ARQAfQl0AKADfAB8CXwHoQNTACkF+txTbGljZSBh\nbiBhcnJheSBpbnRvIGBwYXJ0c2Agc2xpY2VzIGFuZCByZXR1cm4gc2xpY2UgYGlgLgoKICAgIEFy\nZ3VtZW50czoKICAgICAgZGF0YTogYXJyYXkgdG8gc2xpY2UuCiAgICAgIGk6IGluZGV4IG9mIHNs\naWNlIHRvIHJldHVybi4KICAgICAgcGFydHM6IG51bWJlciBvZiBzbGljZXMgdG8gbWFrZS4KCiAg\nICBSZXR1cm5zOgogICAgICBTbGljZSBgaWAgb2YgYGRhdGFgLgogICAgTukBAAAA6QAAAAApAdoE\nYXhpcykE2glhcnJheV9vcHPaBXNoYXBl2gZjb25jYXTaBXNsaWNlKQraBGRhdGHaAWnaBXBhcnRz\ncgYAAADaCmJhdGNoX3NpemXaC2lucHV0X3NoYXBl2gRzdGVw2gRzaXpl2gZzdHJpZGXaBXN0YXJ0\nqQByEgAAAPp4L2dsb2JhbC9ob21lL3VzZXJzL21qd2lsc29uLy5jb25kYS9lbnZzL250Zi9saWIv\ncHl0aG9uMy43L3NpdGUtcGFja2FnZXMvdGVuc29yZmxvdy9weXRob24va2VyYXMvdXRpbHMvbXVs\ndGlfZ3B1X3V0aWxzLnB52glnZXRfc2xpY2W4AAAAcxYAAAAACwoBDAEMAQgBDAEOAgQBEgEWAQgB\n", null, null], "module": "tensorflow.python.keras.utils.multi_gpu_utils", "function_type": "lambda", "output_shape": [28, 28, 1], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"i": 1, "parts": 2}}, "inbound_nodes": [[["conv2d_input", 0, 0, {}]]]}, {"name": "sequential", "class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "inbound_nodes": [[["lambda", 0, 0, {}]], [["lambda_1", 0, 0, {}]]]}, {"name": "dense", "class_name": "Concatenate", "config": {"name": "dense", "trainable": true, "dtype": "float32", "axis": 0}, "inbound_nodes": [[["sequential", 1, 0, {}], ["sequential", 2, 0, {}]]]}], "input_layers": [["conv2d_input", 0, 0]], "output_layers": [["dense", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}